Revit 2025 API
ConceptualConstructionRoofType Enumeration
 ConceptualConstructionType values for Roofs.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum ConceptualConstructionRoofType
Public Enumeration ConceptualConstructionRoofType
public enum class ConceptualConstructionRoofType
type ConceptualConstructionRoofType
Members
Member name | Value | Description
HighInsulationCoolRoof | 0 |  High Insulation Cool Roof
HighInsulationDarkRoof | 1 |  High Insulation Dark Roof
TypicalInsulationCoolRoof | 2 |  Typical Insulation Cool Roof
TypicalInsulationDarkRoof | 3 |  Typical Insulation Dark Roof
LowInsulationCoolRoof | 4 |  Low Insulation Cool Roof
LowInsulationDarkRoof | 5 |  Low Insulation Dark Roof
NoInsulationDarkRoof | 6 |  No Insulation Dark Roof
NumRoofTypeConstruction | 7 |  Total Number of Roof Type Constructions
InvalidRoofTypeConstruction | -1 |  Invalid value/not set Roof Type Construction value
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace